{"podcast_details": {"podcast_title": "The Indian Startup Show", "episode_title": "Aruna Chawla, founder of  Salad - A FemTech startup building wellness for women  & disrupting the face of a $100bn + global industry.", "episode_image": "https://image.simplecastcdn.com/images/5a8e79e6-61c1-44d1-9a82-337838b6b0d3/8999b9ff-10c0-4b39-9055-fe75882d5006/3000x3000/1439050250-artwork.jpg?aid=rss_feed", "episode_transcript": " For me it was my personal journey. Six years ago I had a surgery because 10 years of looking after my PCOS with whatever doctors had told me at that stage wasn't working out at all. So you know for the last 16 years I've been in and out of hospital. Imagine a 14-15 year old girl at the 10th grade board exams in India being told that you shouldn't aim high, you shouldn't be very ambitious, your health is never going to allow it and we don't have a solution for it. Just pop pills and keep symptoms at bay but you're never going to solve for it. So that really started to inspire me. Hello everyone, thank you for listening to the latest episode of the Indian Startup Show and today my guest is Aruna Chawla, the founder of Salad. It's a lifestyle plan mobile app that supports women to better manage their health throughout the menstrual cycle by providing personalized nutrition, fitness and lifestyle advice. Amazing stuff. So in this episode she talks about her own personal journey of being in and out of hospital, talks about building the MVP without a CTO or any developers, talks about where they don't want to go viral or build any landing pages, talks about the first version of Salad which is a condom company which sold 20,000 in two months with no paid marketing. She then talks about her time at Andala Residency where they've raced pretty round and where she met her co-founder, talks about being a FemTech founder in India and the sides of the market. She talks about hormones, period tracking and finally she talks about her super strength and advice on how to build healthy habits and goals using behavioral sciences and much much more. So please enjoy the show, thank you. Hi Aruna, thanks for coming on the Indian Startup Show today. Thank you Neil, thanks so much for having me over. Awesome. Please tell us what you're building. I'm building a FemTech company with my co-founder Karishma Rathore. We are building a CycleSync lifestyle planner for women. The goal is to help them understand what kind of lifestyle decisions to take on a daily basis, whether it's in terms of their nutrition, their fitness, the kind of work they schedule, what their day looks like in a way that keeps their hormones balanced. Now this might seem quite counter-intuitive, right? When we look at healthcare traditionally, we think of magic solutions, you know, you look at protocols to follow, you look at supplements to pop. Conversely our belief and our research shows and suggests that you know holistic health can only be enabled at a lifestyle perspective, you can only enable holistic health on a day-to-day perspective. Okay excellent, sounds exciting. What was the initial desire to do this? What was the like the light bulb moment? For me it was my personal journey. Six years ago I had a surgery because 10 years of looking after my PCOS with whatever doctors had told me at that stage wasn't working out at all. So you know for the last 16 years I've been in and out of hospital. Imagine a 14-15 year old girl at the bring you know 10th grade board exams in India being told that you know you shouldn't aim high, you shouldn't you know be very ambitious, your health is never going to allow it and we don't have a solution for it. Just pop pills and keep symptoms at bay but you're never going to solve for it. So that really started to inspire me and I come from a family of doctors and naturopaths and horticulturalists right so I'm very I'm as a family environment we were attuned and you know open to the kind of access that the best medicine could get us and yet there was no solution. So six years ago because of my own journey I started on this journey on you know building healthier habits, balancing my hormones. I read law at university and worked at UNESCO chair of cultural policy for a couple of years as an art and fashion lawyer. So very very different worlds right but no matter how passionate you are about your work I think if your health doesn't allow you to show up and wake up every day you're not going to be able to do anything right. So despite the fact that I used to love the work I would do my health would just not allow me to perform at my best capacity and that started to frustrate me a lot. So started on this journey of you know learning more about consumer psychology, how you can build healthier habits, switched career paths and focused a lot on nutrition. So I'm a certified nutritionist as well now. When I got to Antler India's residency they conducted it last year. It was really an opportunity for me to share the research I'd been doing for the last six years in women's health and the kind of lifestyles women in India lead, the kind of access we have to medical care and not just sick care but also health care right and I thought I'll talk about this later as well. At the residency met my wonderful co-founder who'd also come in with the idea of start starting up. On my end it was simply you know there's this huge opportunity. I'm not really sure what can come out of it but let's experiment and let's see what happens and when I met my when I met my co-founder it was as those serendipity stucco where you know our combined skills together led us to what we're building today. That was really what happened. There was no single light bulb moment for me that you know said I need to you know become a startup founder or I want to start a company. My goal was simply that whatever I'd gone through as a young girl during my teenage years during my early 20s is not something I would want others to go through so is that a way to solve for it right. I truly I wasn't thinking big in terms of scale at that stage you know how you could productize something like this and help millions of women across the world. I was only looking at how can we really start to get the conversation going. That's how actually Salid started so there was no single light bulb moment. It was simply deep passion for the space and a deep personal connection to you know solving for healthcare. Yeah so how are things going then? Can you share some stats? Absolutely so we raised our pre-seed round in January of 2023 so two months so about two months ago from Antler India. We are currently a four-member team and are building our our MVP which launches next month. The goal is to start with five goals. We're starting with five goals and that's very interesting right. We see that when you want to build new habits aligning it to a certain goal keeps you keeps the user focused and direction otherwise if you don't see progress if you can't measure progress then it's far easier to backslide. So we're starting off with five goals. Two are related to period health. Two are related to general health and energy. One is related to losing weight safely. So you know we're picking up individual goals for now to solve the most common problems and the plan in the long run is to continue to build out a library of goals and food options and lifestyles etc. As we launch in April we have a wait list where we will launch to in the early days. The plan is not to go viral at all. We want to very methodically onboard the right people who are committed to you know their health and their lifestyle. Folks who would potentially be looking for you know a magic solution won't even be the right fit for us in the sense that we won't be able to serve them because our focus is helping users or helping the women that we work with build healthier habits so that they stay healthy in the long run. How excited are you about this then? I am mind blown with the kind of response we've got right now you know. We haven't really openly started talking about the product. There are you know how traditionally you would have a landing page you would have some product screens for example. We've done none of that. Karishma and I decided to simply share our story and what we're building and how we hope it will help folks and just that has led to so much word of mouth. People are coming to us and telling us you know that they're eagerly waiting for the app to launch because of their personal experiences. Every day we meet women who share their stories with us and it's so humbling and gratifying that we get to be in a position to serve them. So it's tremendously exciting because every woman that we help lead healthier lives, we're not just helping her, we're also helping the friends around her, we're helping the family around her, we're helping kids to come after her. So it truly is you know generational change that we can enable in the long run and that's what at least what excites me the most about the work we get to do today. Cool. Can you share a story then? Your favorite story then? Actually you know I'll share my co-founder's story because we get this asked so many times right, what is your aha moment for Karishma and I don't mean to speak on behalf of her, this is a story you know she's shared publicly as well so I take the liberty to do it. So you know as if you don't look after your health, what happens is that our bodies are very resilient so for the longest time they will continue to support us even if we don't look after it but as we start to grow older it's going to start wearing down so you know even if you are following the exact same lifestyle protocol as you did five years ago, if it's not healthy, if it's not something that's nourishing your body, it's going to start showing symptoms and that was something that was happening with Karishma with her personal journey and you know when we started to talk about this space, what got us together in the early days was her intention of building something very impactful at scale and for me it was building something that's impactful in the space of women's health. During course of these conversations as I kept sharing research with her not just on the behaviors of women in India and whatever research I had done for women across the world and how they access healthcare but also in the space of hormonal health, also in the space of cycle syncing which is you know the science of reproductive physiology that we use where you know your day looks different each day depending on the phase of your cycle because your hormones are different. She started to get these aha moments which made her realize that her health can actually you know be managed very effectively if she were to start following these and I think that personal you know that each time you realize something that lights the bulb in your head about how big this can get just because of your own experience I think that really pushes you know you to continue to do or practice this protocol. Let's go back to the start of your entrepreneurial journey. I think originally was a selling condoms. Just talk about that story then that sounds interesting. So I think like you know for somebody who's never been interested in the idea of being an entrepreneur or a founder I realized that I've always been entrepreneurial which is that you know since I was in school I was always working with my parents and you know I would be part of the family business doing something with the other it would just keep me super engaged. Salad condoms actually started as an experiment that I wanted to conduct to understand and you know how folks in India access sexual wellness. I was still very focused on women's health and wellness which is why you know the entire brand positioning of salad was health focused the kind of product quality that we you know sourced from our vendors focused on ensuring that women when they use the product actually don't get any allergies or rashes and this was a lot of learning that I was doing in my day job at that time. I was working with a US based marketing company as a behavior scientist where we focused on everything marketing strategy from the perspective of what is going to help consumers make a purchase decision but had never experienced or understood anything about the Indian market so far so this started as an experiment over a weekend I'd set up this Shopify web store at that time you know clubhouse was all the rage and I would turn up every day for half an hour one hour just to talk to people and you know join some clubhouses listen to their stories share what I'm working on that actually led to so much word of mouth and organic coverage in news in PR and media that we ended up selling about 20,000 boxes of condoms from our Shopify web store in the first two months without any paid marketing. I didn't know back then but and I know this now that you know this is called doing things that don't scale to solve the problem of kickstart but I really didn't know anything about it at that stage so it was more of an accidental entrepreneurship for me now surely you know it's a very interesting space I think with India itself it's you know where some founders can choose to start off with the small niche of sexual wellness and then continue to expand to you know the general women's wellness space from my limited understanding at that time I didn't see myself as the right founder for a market like that because I didn't have enough knowledge of e-commerce at that stage I was very new and as a solo founder you know it's very difficult to continue to learn new things and also run the company. Retention was a huge challenge simply because of the space that we were in which is why I decided to take a step back and you know continue to do my research in this space. I hadn't quit my job at that stage so you know I wasn't struggling with funds or just the idea you know that this has to work. I was playing very safe at that stage it's only when you know I'd got through the antler residency that I finally quit my job and this came after almost a year and a half of intense research into how women in India actually access health care all throughout you know I'm very interested personally in the space of preventative health because sick care is just a bandaid on the wound that already exists but there is so much potential to prevent you from getting hurt itself right. That's why you know the space that we're in with hormonal health we are focused very intentionally on the moderate and languishing conditions of health you know the concern and one of the most common things that we heard from the people we interviewed was that they have resources these problems or the symptoms that we are working with or you know the goals that we have to start with are things that they at people care about they're impacting the quality of our users lives but because they're not chronic conditions because they're not very serious or disorders given the limited bandwidth that doctors in India have they're not actually able to access solution you know they're shut off or they're sent away saying that it's not that big a deal just pop a pill and deal with it you know come to them only when things get really worse and I think that's phenomenal because the condition of health care in India today is not just you know that people want more access to doctors we have enough doctors in every nook and corner of each city that we are a part of or each village that we are a part of it's that do we find the right kind of solutions for our lifestyle for our you know the kind of challenges we face and is it bio individual as well because otherwise what happens is there are these template solutions that everybody is given but it doesn't work because our epigenetics are different our conditions are different the food the kind of food we eat the kind of lifestyle we need completely different or the kind of preferences we have completely different again it's all of this that we want to bring into our product at salad as we solve for it not just for India but also the global market in the long run sounds good to me you mentioned MVP any advice for our listeners on building an MVP what must they do what must they not do yeah I can share our experience so we're a health tech company without a CTO at this state or an engineering team in house at this stage because women's health is very tough difficult there aren't enough women you know tech leaders especially in India and it's been a huge struggle for us but it was very clear for us that you know we don't want to spend up a precious time in just getting the right you know team member for this but let's get started on the MVP so we outsourced it to an agency we figured out you know what's the least that we can get started with so that we can start to show some kind of results we don't think with the MVP launching we will be able to show 100 results right because at the MVP stage we're focusing on personalized fitness and general nutrition and all of this is hardcoded into the engine the machine learning engine that we you know are placing our bets on in the coming years as we the you know the secret sauce to our success will actually not even start for the longest time however having said that we didn't want to delay product launch because it's only when we launch the product is when we'll start to you know understand how users are actually using the product what are the kind of changes they're seeing in their lives what's working what's not working that was that that's been number one for us the second thing that we've been doing in-house is attempting to conduct experiments on no code so you know pilot programs of simpler features that you know will form the entire salad ecosystem and this has been done on over whatsapp with 18 people 20 people etc so it's not so you know there are a lot of these tinier experiments that we're doing on the side that we believe are critical for any first time and not just first time founder but any founder for that matter because you know hard coding and experience takes time it takes energy it takes resources it also takes away from other features that you might build but if you have certain idea or you know on a no code experiment or you know a low code pilot also it makes things all the more easier because then you go into product building with a lot more information before we started building our product we'd already done a ton of research right we've spoken to almost 1000 women across tier one tier two india to really go deep into understanding what their lifestyles are like and what are challenges they struggle with and then to identify how we can help them however having said that i don't think that's ever going to be enough as we launch the product we need to consistently you know be showing it to people seeing how they use it getting feedback from them in terms of what's making a difference and with difference and what's not we do see today that you know with the kind of response we are getting people are very excited but we also need to see you know how how deep the retention is going to be and that can only come after product launch in terms of mistakes made or actually say learnings what's been the sort of key takeaway from that from your your entrepreneurial journey so far i think uh personally one thing that i'm learning now to do is uh stop and think i'm a person with you know a bias for action so much so that at times you know i don't think things through before jumping into just doing them and i think at this stage execution is critical right there's there's only so much thinking you can do but if you're not executing nothing happens but i think with without thinking things through very deeply and from all perspectives your execution can fall short and that obviously leads to you know loss of credibility and we've experienced that in the last two three months itself as a team as well so that's one thing i'm i'm personally learning um that's been the biggest learning for me in the last three months okay and what's been the best day so far i think like um the day you know i think you know for me the day that kashmir and i started to work together and one of you were in one of those days right we were actually looking at how we can work on our own lifestyles uh what are the learnings that we have for our own things and you know just that i'm not a person neil when you know as i give you the example right i want to clarify that i'm not one of the founders who ever wanted to be a founder so startup or no startup or fundraising or no fundraising that's not motivating at all for me but the kind of impact the work we do can have really makes a difference you know just seeing my teammates uh the way you know they're utilizing this knowledge the way they are utilizing uh the science of reproductive physiology in their personal lives and the impact that they continue to see is actually extremely motivating for me because i think if we can continue to do it for ourselves we will have so much more empathy for our users and we will continue to you know be able to do it for them as well or at the product level so i think those have been the best moments of my uh the last few months for me what was your first impressions of meeting your co-founder then um so when i met her we were about 70 people in the same room you know i really went there with my mind completely open uh to the idea that i'm only here to network with folks and explore what potentially can happen uh for me it was being there was a win-win solution because either i come out with a funded business or i come out with a business plan that may not be venture backable but bootstrappable and that's also a great opportunity for me or i did i decide that i would don't want to do either of these things i go go back go out with you know a huge network of people uh who are startup founders who are doing great things in their life who come with so much talent and their own network and go back to the job i had right so for me it was simply a win-win situation which is why i approached the entire process of the residency with a lot of positivity and open-mindedness what clicked very well for for me when it came to my co-founder is our shared values and our shared intentions of the kind of life lives we want to lead right we're very similar in some of these core critical aspects and you know that those things matching those values matching i think really make it made it easy for me to start working with her getting to know her or just being friends with her which i think is very important because it's such a long artist journey every day is difficult frankly even good days are going to be difficult because there's always so much to do you're you're consistently prioritizing your startup over every other thing and having you know somebody you can depend on and trust blindly i think makes the whole journey so much easier it's like a marriage it's like a marriage indeed how do you split up their roles then in terms of you know within a company you've got hr you got sales web development sure so we're a very lean team as of now we've only hired two folks in the last three months and we intentionally want to keep lean work more with vendors and externals right at this stage because we're at pre-seed it's only by the time we get to see we want to be in a position where you know we've figured our product out as much as possible can see some early signs of pmf and that can only happen if our entire focus is on building the right product in terms of split karshma looks after product and you know engineering development externally i look after growth and you know the domain expertise domain expertise in behavior sciences nutrition and hormonal health in general along with that i also look after legal finances etc simply because of my past experience as a lawyer so that comes in handy i think what's very cool for startup founders today is just the host of tools you have available right payroll is frankly so painful to deal with just because of how complicated it is but there are tools that you have you know that make it so easy and at a click of a button and i think if you're able to leverage that for the longest time then it's just so much easier how big is the market then the market's actually quite big right in india itself we have about 355 million active menstruators at this point right uh we know 70 percent of them through research need about at least one kind of hormonal health intervention when you know when we say hormonal health most folks will think of infertility or pcos or thyroid maybe but even things like depression or anxiety or mood swings or bloating or vaginal dryness or endometriosis or thyroid or obesity or fluctuating weight oh you know there's just so much that falls under the gamut of hormonal health for women that it's a huge huge market just uh so there's a lot of opportunity globally this number is at about 1.8 billion women who menstruate on any given day and about 85 percent of these need some of the other kind of hormonal health intervention it's very surprising that you know you know for something as as basic to our functioning as our hormones we still don't have enough knowledge and that it's a long way to go frankly because it can be something as simple as you know having hormonal acne and not knowing why they're happening or how to solve for them without without just antibiotics or medicines right i strongly believe food is medicine the way we lead our lifestyles the time we go to sleep how well rested we are all of these things have an impact on our health and more and more people are starting to understand and realize this in the last few years right with covid coming in more focus on self-care happening that there's a lot of potential even within the femtech space to start looking at women's health outside of traditional fertility options what's it like being a femtech founder then in india uh it does come with its own set of biases right um um i think like it's very easy for folks to dismiss you as just uh you know making a human cry about something that's not very important or folks some folks thinking that you know femtech is such a niche even though it's 50 percent of the world population all we're asking for is that you know our bodies are different and we should get the get the kind of treatment or support or health care that aligns with our body and aligns with the way our body works or our hormones work so i think those things continue to happen i think we're very lucky uh and also grateful with the kind of investors we've got on board with antler and you know they've been they've been phenomenally supportive and they continue to push us and you know open doors for us wherever they can and i think just finding those right folks to support you makes things so much easier what's the best advice they've given you then i think uh for me it's been that you know you won't always know everything but as long as you keep showing up every single day things are going to work out this was in some ways feedback that i've got that you know one of my super strengths is the fact that no matter what happens i'll keep showing up every day and i think i didn't i never realized it back then but when they pointed it out it's stuck by it's stuck by me and you know it keeps me going even when days are down uh what motivates you to keep going then i think that you know for me i would be in the space of women's health whether i'm starting up or not starting up or doing a job or you know consulting folks individually so for me this is really my life's work i cannot forget the first 10 years of you know being diagnosed uh with pcos and being in and out of hospitals i remember very very clearly everything that i'd gone through everything i had to hear everything i missed out on as a teenager um and i think that's that's the fuel that keeps me going in terms of the femtech industry the sexual wellness industry in india how's that evolved is that is that is this now a mature market is it still immature market where are we now i think it's a very very early time to get in uh whether it's for femtech or for sexual wellness either of these the sexual wellness market is very tiny right now right what you'd mostly see is contraceptives that's that that forms the bulk of it for the cream of the society you'd also start to see wellness products like toys and experiments but it's still it's not very tech focused right now it's still very e-commerce and distribution driven at this stage right um so very early market with you know uh only so much of uh uh conservative mindsets opening up uh to this being comfortable and normal um but long long way to go when it comes to femtech actually in some ways traditionally also it's always existed right fertility uh or pregnancy is one of the largest markets for health care for women not just in india but globally as well we've just never realized the importance of how different it looks like and what beyond just sick care to provide for women um at salad our focus is that you know uh fertility is 100 an important part and in fact the work we do a one a national byproduct of your hormones being balanced is the fact that you will be more fertile you know your pregnancy will be easier um in terms of your fertility i'm not talking about epigenetics but just that you know your fertility levels will go up um it's also that everything else about our bodies is also impacted with through the same science right whether it's our productivity our energy our fitness levels how horny we are whether our skin glows or not our hair care um our weight all of these things are dependent on our hormones itself right in femtech itself there is so much uh happening there's so happening there's so many innovations happening in india but it's still a very early market uh what's promising is the fact that more and more women are coming out to and joining the workforce they're finding certain some kind of you know financial independence there's disposable income going up and due to that education's uh about you know women's health and wellness is rising so i think it's a promising time to actually enter the market and you know have the potential to be the early market leaders and i don't think it's a takes all market frankly even at this stage it's very very early for that awesome so last few questions then um you mentioned wellness go on give us i'll give our listeners some healthy habits what should they be doing okay um i for the women folk listening here please track your periods it's what every smart woman should do uh your period data is one of the easiest biomarkers to tell you how your health is for the rest of the month in fact at salad we start with period biomarkers so once our app launch you won't you will not just be tracking your periods but also understanding how your body can be optimized and you know work towards your best potential for each phase of the cycle that's one the second i would recommend is prioritize movement over exercise if you're exercising that's great right but fitness does not just mean exercise it also means movement it means how often you can walk if you're on call or if you're on meetings can you take them while you're walking prioritize eating even if you know you want to lose weight see where you are in your cycle to ensure the right kind of calorie deficit and focus on bio individuality whatever you see online take it with a grain of salt because it may not suit you so focus on what suits you and what suits you well and that's just the easiest way to get started awesome stuff and any advice for our first time founders what should they be focusing on i think take bets on yourself um the worst thing that can happen is living with the regret that you could have done something but you didn't give it a shot i don't know if salad will be successful or not but i do know that this journey is very rewarding already for me and i think that's worth it that my eyes are on this kind of prize not the price of you know how much we raise or how much we don't raise it doesn't matter to me frankly has anyone you like to thank any mentors that have helped you on your journey friends or family absolutely i think my uh both sets of parents you know my my biological parents and my in-laws and my partner they've been phenomenally supportive uh and continuing to push me you know to do this uh my sister as well my sister-in-law as well and i think you know when you come with that kind of confidence at home it really starts to show up because you're not fighting that battle so i think they've been my biggest cheerleaders and biggest support system yeah last question for people who want more information on what you're doing what you're building um how do they get involved how do they get in touch absolutely find us at grab salad.com we are called salad because it's holistic everybody across the world understands it it's very healthy um you can make whatever kind of salad you want you can make it bio individual and have it and enjoy it uh so very excited for this please reach out to us on grab salad.com find us on social media with the same handle um and we'd be happy to get in touch aruna thank you for coming on the show today thanks so much neil thanks so much for having me over i really enjoyed it thanks to aruna for coming on the show today and for more information go to grab salad.com thank you for listening and support the podcast if you're building something exciting please email me hello at neilpatel.co or tweet at indians.psh or go to facebook.com for slash indians top show i would love to connect thank you and goodbye"}, "podcast_summary": "In this episode, Aruna Chawla, the founder of Salad, discusses her personal journey with health issues and how it inspired her to build a FemTech company focused on women's health. She talks about building an MVP without a CTO or developers, the importance of personalized nutrition and fitness advice, and her plans for helping women build healthier habits. Overall, it's an inspiring conversation about the intersection of technology and women's health.", "podcast_recommended_for": "This episode is recommended for individuals interested in FemTech, women's health, and the use of technology to promote healthy habits.", "podcast_guest": {"name": "Aruna Chawla", "organization": "Salad", "title": "", "summary": ""}, "podcast_highlights": "Key Highlights from the Podcast Episode:\n\n1. Aruna Chawla, founder of Salad, shares her personal journey of battling health issues and being told to lower her ambitions due to her condition. This inspired her to create a FemTech company focused on helping women manage their health through personalized nutrition, fitness, and lifestyle advice.\n\n2. The initial motivation to start Salad came from Aruna's own struggle with PCOS and the lack of effective solutions available. She wanted to create a platform to address the challenges she faced and start a conversation about women's health.\n\n3. Salad is building an MVP that focuses on five goals related to period health, general health and energy, and safe weight loss. They aim to provide personalized solutions to common health problems women face.\n\n4. Rather than going for viral growth, Salad wants to methodically onboard users who are committed to their health and developing healthy habits. Their focus is on making a long-term impact on women's health.\n\n5. Aruna and her co-founder, Karishma Rathore, met at an entrepreneurial residency program and found a shared passion for women's health. They believe their combined skills and values will drive Salad's success.\n\n6. Aruna shares her experience of starting Salad as a condom company, conducting experiments, and selling 20,000 boxes of condoms in two months without any paid marketing. However, they shifted their focus to women's health and wellness as they saw a greater opportunity in that space.\n\n7. The FemTech market in India is still in its early stages, but there is a growing awareness and demand for women's health solutions. Salad aims to capitalize on this market by providing personalized and holistic healthcare options.\n\n8. Aruna emphasizes the importance of tracking menstrual cycles and prioritizing movement and bio-individuality in maintaining overall health.\n\n9. Her advice to first-time founders is to take bets on themselves and not be afraid to pursue their ideas. Having a strong support system from family and mentors is invaluable in the entrepreneurial journey.\n\n10. To learn more about Salad and get involved, visit grabsalad.com and follow them on social media."}