{"podcast_details": {"podcast_title": "Rajiv Malhotra's Podcast", "episode_title": "Memes do not always follow Genes | Reimagining the Aryan debate", "episode_image": "https://d3t3ozftmdmh3i.cloudfront.net/production/podcast_uploaded_nologo/2111804/2111804-1671006673279-7ad1ab4842278.jpg", "episode_transcript": " The route taken in the transfer of knowledge is not necessarily the result of a large number of people going. So, if you consider information and knowledge to be memes, memes do not travel along with genes. You do not have to have a genetic export in order to have a memetic export. When my book Snakes in the Ganga came out, Arnab Goswami interviewed me. So, it was a good 45 minutes interview. And he wanted to go into the details of what we had discovered. And I was disappointed towards the end by his question saying, how does it matter if some ignorant people in Harvard are saying all these things about us? We shouldn't care. And if you apply that same logic, when Max Mueller came up with his crazy theories, that was also an ignorant person far away. But it did affect us. So, what people write and say about us, far away as it might be, one man writing something can come back and haunt you. The whole Dravidian movement started with one man, Robert Caldwell, a Scottish man. The whole caste thing started with Lord Risley, one man. The whole destruction of Sanskrit and replacement with English started with Lord Macaulay. So, you know, what one man does can affect you, change your life. And this is what we are dealing with. These are the problems we are dealing with today. So, I want that our appreciation of history and the importance of correcting history, correcting the new fraud that is being perpetrated today that will affect the future narratives that we have to live with and our children will have to live with, our grandchildren will have to live with should be a matter of concern and we cannot be complacent and say how does it matter. Because what General Bakshi is doing is trying to clean up, counter all the falsehoods that have allowed, we have allowed, our previous generations have allowed, they did not counter when people like you know, Max Miller did all this stuff and this went on for several generations. We did not counter it. Our people at that time, the scholars didn't, they were complacent. They didn't think it was important enough to worry about it and look where we are now. So, the motives for the Aryan theory need to be understood. It didn't start as an Aryan theory. It started with the discovery, European discovery of Sanskrit and they wanted to have a history of Sanskrit. They want to discover the most amazing language in so many ways and they wanted to take ownership of it naturally. So, the argument started within European communities as to what is the history of Europe in relation to the history of Sanskrit. And there were different schools of thought. Some of them said that this is an Indian thing that came to Europe and the Indians, present Indians are degenerate form. The pure form is what we got. So, there was this kind of out of India theory which said that the Europeans got the more pristine form and the Indians got sort of degenerated because of whatever happened to them. There was a theory, out of India theory was there as General Bakshi said it was there in the early part. And then there was this issue of if we the Europeans are our ancestors were Sanskrit and it is far better than any language we have today then how can we not have the same religious ideas that those people, those rishis have. You cannot love a language and hate its philosophy. So, if you like its philosophy what about Christianity? So, there was this whole debate on the Sanskrit Vedic philosophy versus the Christianity and there were several scholars in Europe who tried to reconcile them. Who tried to say that what this Vedas is saying is actually Christianity only. They tried to make that argument. But that didn't fly. That didn't fly. And then it became clear that the Vedic argument, the Vedic metaphysics is closer to the European pagans and Christianity had killed those pagans, wiped them out, destroyed them, genocided them and now here comes a language which says that was actually superior. So, now if you say that that is our ancestral language how do you deal with that? How do you deal with Christianity what it has done to all these pagans who were in fact polytheistic and similar to the Vedic period. So, these debates went on for a long time and then in the, after a few generations of that then comes Max Miller who comes up with this race theory that the Europeans took this to India and what not, what not. Now, after that the Dravidian counterpart because if you have, they are two sides of the same coin. If you have Aryans you have Dravidians and vice versa. So, the Dravidian part which was started did not take root in India right away. In fact, it was rejected by most people who thought this is kind of crazy stuff. Dravidianizing the Tamil language and the South Indian languages but later on, later on in the 1900s, this became a kind of fashionable thing. The Dravidianism became politically interesting, politically kind of an identity engineering technique. So, now we have the Aryan idea and the Dravidian idea in conflict and even if one of the things, one of the problems we have today is even when we get rid of the Aryan invasion and the Aryan race separation and all that stuff based on all this logic, all this wonderful work, the Dravidianism is well entrenched. So, now the consequence of the Aryan theory which was Dravidianism has taken a life of its own. So, even if you get rid of the Aryan problem, the Aryan political problem, the Dravidian movement is so solid in Tamil Nadu that it's not something based on logic and science and you can keep saying that look, all your ancestors were same as ours. Here is the logic, here is the argument. But being Dravidian is a normal thing now in the education system, in the political stuff. So, that's an issue to deal with. That's one of the obstacles we have which is right in our own country we have that obstacle to getting rid of the Aryan theory, the foreign Aryan theory because the claim being made is that we the Dravidians are the real inhabitants and these guys are not really as a authentic Indians and so on. The other issue that we have to confront is the British started this idea that since the Aryans were foreign, we the British are also foreign, we are just continuing the civilizing mission. The British are continuing the civilizing mission of the natives which the Aryans had started. So, why do you want to get rid of us? We are just completing what was already being done. Now, the reason you might ask why do the left wing today support the Aryan invasion theory? That's an important point. They do support it and when you deny the Aryan invasion theory and you come up with all these arguments, they call you chauvinist and fascist and whatever they call you and you wonder, you have to answer them. Why is it so important to them? Well, the reason it's important to them is that this whole argument that Muslims are foreign, it's a foreign thing that came to India from somewhere else. One of the counters that the left gives is that, well, so are the Vedas. If the Quran is foreign, well, so are the Vedas. The Vedas are also brought by these Aryans. So, that's an important political argument which is upheld by the left to justify more recent foreign invasions and foreign imposition of texts and religions on us. What they want to say is that there is really nothing Indian because what you consider to be the original faith and the text and the language were also foreign. You were really nothing. There was no civilization until foreigners brought the Sanskrit and the Vedas and all of that. So, the whole of Indian history is one invasion after another is like a layered cake. There is a layer and another layer and another layer and so what if some more recent layers have come and it's just more of the same thing. This is an important thing for us to understand if we want to counter because we must know why our opponents, the extreme left, are hanging on to the Aryan invasion theory. So, I basically brought it down to two things. One is the Dravidian movement is hanging on to the Aryan because it gives them a sense of we are the true, you know, owners of this soil originally. And the second opponent we have to fight is the global left because it gives them a logic for further conquest, a logic for, you know, that there is nothing native about India and Indians anyway. So, why are you complaining? These are two things we should always keep in mind that we have to counter. And these are the sort of things that I am fighting now. Now I want to take, discuss something else. Tell you a little bit about the modeling that I am working on in this whole area of human, the movement of ideas. I am more interested in the movement of ideas than in the movement of genetic material and people. My work is more theory of, you know, where knowledge comes, how it moves around. And one of the things I discovered is that so often, I will give you examples, often knowledge and culture do not move in the same direction as a mass migration or an invasion. If knowledge moves from point A to point B, it is not because people moved or there was an invasion or privately or peacefully they moved. It has nothing to do with that. I will give you some examples. So, one example is that Sanskrit in modern times, when it went to Europe, one of the first persons as a Sanskrit scholar, proper Sanskrit scholar in Europe was a British man called Hamilton. Hamilton was visiting India to do some research as a Sanskrit scholar. And there was a war between the French army and the British army in India. The French and the British were fighting for territory in India. And the French captured this British scholar, did not know he is a scholar, thought he is a soldier. And they made him a prisoner of war and they sent him to Paris. So, this Sanskrit scholar of England ends up in Paris as a prisoner of war. And he is teaching. He is not treated. He is not thrown in some jail or something. But he can't leave the country. So, he starts the Sanskrit academy. And guess who shows up to study under him? People like Friedrich Schlegel, the German. That's also an enemy country. So, spread of Sanskrit education and higher learning across Europe has nothing to do with some Sanskrit army going to Europe to conquer them. It was not a mass migration of pundits who went there to conquer them. It was one English man who went, captured and taken there. And that's how the Sanskrit education started. That's how the first PhDs in Sanskrit were given in Europe. Another example is if you go to Brazil and various parts of South America, their national dance is called the Flamingo. The Flamingo dance. And the Flamingo dance, they will tell you, came from the gypsies of Europe. It's an influence of gypsies of Europe because the Portuguese explorers and discoverers, they went to South America, they discovered what became known as Brazil. And they took a lot of culture with them and some dancers and people like that from Europe. And this took root in Brazil and became a very popular Brazilian dance. And these gypsies of Europe are of Indian origin. They are the Roma people. So, now you have people from India who go travelling around and settle in Europe. And there, some of their culture is then taken by some explorers and traders to Brazil. But it would be wrong to say that Indians invaded or migrated to Brazil and brought the dance because it had multiple hops. And it travelled a very complicated route. And this, the route taken in the transfer of knowledge is not necessarily the result of a large number of people going. So, if you consider information and knowledge to be memes, memes do not travel along with genes. You do not have to have a genetic export in order to have a memetic export. The genes could take memes, but not necessarily. Another example is Buddhists. Buddhists from India, sometimes two Buddhist monks, you know, on a ship, trading vessel, two guys carrying some texts and carrying some medicine, ideas and philosophical ideas and all that would go to Japan, would go to China and an emperor would receive them and want them to teach, become a big shot in the university or some kind of centre of learning. And these very small number of monks would create a whole transfer of knowledge into China. Or they would send, the emperors would send their best students to places like Nalanda to learn and bring knowledge back like people today send the cream to places like Ivy Leaves in America to learn something and bring it back. So, transfer of knowledge from India to China was not the result of mass migration of people or an army. So, what I am trying to say is that the movement of knowledge, which is my topic of interest, I discovered so many examples that had nothing to do with the movement of people. It's an independent thing. It's an independent thing. So, even if somebody claims that some genetic movement happened from Europe to here, like some of them do claim, my answer is so what. We are interested in the history of Sanskrit and the history of Vedas and it correlates with the flora, fauna like Bibi Lal and you have said. And that is sufficient proof. Regardless of where people came from, it doesn't matter because it doesn't mean that just because people came in that they necessarily brought these kind of things. They are too independent. The movement can be independent of, the movement of knowledge and ideas can be independent of the movement of human beings. And there are so many examples that you can go on giving. Europe did not have potatoes. And these came from the Native Americans. But the Native Americans didn't invade Europe to give potatoes. Tomatoes didn't exist in Europe. Now, today you tell an Italian chef that, you know, a few hundred years ago you guys didn't even have tomatoes. And how did you make Italian food? I mean, you cannot imagine Italian food without tomatoes. And you cannot imagine European food without, you know, some potatoes, something. But these are not European. And they came from the Native Americans who never went with, who never went on a large scale of any kind to bring their knowledge. Europeans went there, learned these things and brought it back. Similarly, a lot of Indian music, cuisine, mathematics, etc. went to the Arab countries without a mass migration there. Some of them were taken as slaves. In fact, there is a large history of Islamic era slavery from India being taken to Central Asia. A lot of that in the archives of the former Soviet Union they had these records of ancient slave trade from India to the Central Asian markets. And then a lot of these people would be graded in their price based on their skill. Somebody who knew how to sing, somebody who knew how to cook, whatever, you know, people who are more knowledgeable, their value is more. So, a lot of knowledge transfer happened not in the direction of the invasion but the opposite direction. Because the invader goes, brings slaves back and those guys have culture that they can, that gets transmitted. So, the conqueror is not the one who gives you the gift of culture. People keep saying that when they find a correspondence between Indian music and Arab music or some Indian, some samosa or some, you know, tandoor or whatever, it is assumed that because they invaded us they brought it here. Lot of people think that way. But that is not necessarily the case. The invaders come to a place which is superior culturally. Maybe, maybe militarily they were stronger and they conquered them. But they were culturally weaker. They may have been barbarians and they learn culture, they learn language, they learn mathematics, they learn better cooking and agriculture and all that and bring it back to the country. So, the flow of Indian culture to the Middle East while the Middle East earners were the ones who brought genetics and their militaries came and settled here and conquered here. The flow of knowledge and the flow of genes is opposite sometimes. So, I think this is a very interesting point just to, because I think it can help us in our debates. Often I use this in my debates. Somebody puts up some chart and says, you know, here is some proof of some migration into India and I tell them it is irrelevant because it has nothing to do with the origin of the Vedas and the origin of mathematics and the origin of science and the origin of Ayurveda and all that. That, the way we prove the history of ideas and the transmission of ideas is a whole different methodology which is what I am developing. The other thing that I want to point out is continuity of civilization is definitely there for us in our civilization. But continuity does not mean frozen. It does include evolution, change, including digesting ideas from elsewhere. Including the digesting ideas and knowledge from elsewhere. In fact, it is a hallmark of a good civilization if it is, if it is able to assimilate new ideas from elsewhere, if the framework, if the basic architecture, if the stomach that is digesting is strong enough that it can digest a lot of things. If it rejects other things, if it is closed minded, if it is frozen, like the Islamic culture, it is very difficult to digest new things in it because it is not so open. So, in our case, Shruti being fixed long term, what it is, but Smriti keeps changing. So, the whole lot of knowledge as Smritis has been coming. And we have to encourage that. We have to learn, teach our people, okay, now let's figure out how to put artificial intelligence into Sanskrit. We have to do these things. We cannot sort of say that we have a perfect past and we don't need to learn anything new. So, I wouldn't say that continuity of civilization should be equated with fixed, same, frozen kind of an idea of civilization. And we are often criticized that, you know, these Hindutva people and the saffron and all that, in claiming, they are claiming that everything was perfect and the Vedas were perfect and they, and nothing else, nothing, no foreign influence came. And if we take that position, it's easy for others to refute. It is easy for others to sort of give counter examples and say, well, here is something that came and there is something that came. So, I don't take the position that continuity of civilization requires that there be no change. I think it's a healthy sign that we can assimilate, we can learn, we import knowledge, we export knowledge, all of that. Problem of Western historians in trying to make sense of India comes from their own fixation that nation, which is not the same as Rashtra, nation has to be one race, one language, one religion. And that's, and here you find that's not the case. I mean, you don't find that in India. So, it cannot be a nation. That's the origin, that is the logic, the false logic that on which they said that India was not a nation until we made it or the Mughals made it or something like that. The concept that a Rashtra does not have to have one race or one faith or one language, it's a whole different kind of unity. So, we have to, we have to articulate, and I am writing one of my books on the Rashtra and how it's different from nation. Because we are a unified Rashtra, we don't want to be thinking of ourselves in terms of nation because that's when you get into trouble. And I will say that in my writing my book on Rashtra, I went to some senior people in the Sangh, RSS, and I said that since your name begins with Rashtra, Rashtra Svamsivik Sangh, I want to know what's your view on Rashtra. And they referred me to Hegdevar and Goldwalker and the writings on, you know, the early writings. And I was a little surprised and a bit disappointed that their writings talk about the European origin, the European concept of nation and quote many European scholars many European scholars and then say we too have a Rashtra like that. So, we've actually copied the European idea of nation and not gone back to the Vedic origins to discover what Rashtra is. So, I have been looking into what do the Vedas have to say on Rashtra. And the Vedas have a few dozen occurrences of the word Rashtra. And that is a very interesting thing. If you, I'm going to put out this whole thing. What is Rashtra? How is it different from nation? And how is Rashtra different from Rajya? In fact, the person we call Rashtrapati should be called Rajyapati. Because that is not Rashtra, the head of Rashtra, that is the head of Rajya, the state, head of state. So, I'll conclude here. These are just some of my thoughts. Because I feel that this, I feel that this war is a 100 year war. We got to keep fighting this. It is not like this is going to be ending because every time a brilliant writer like General Bakshi puts something out, then you know, they will rebuttal it. They will come up with more logic. There will be more and more ammunition coming from their side. So, we have to keep doing this work and keep training young people to continue the more research, more ideas. And what is brilliant about General Bakshi is he works with multi-disciplinary experts. Whether they are linguists, whether they are genetic people, whether they are archaeologists, whatever, art historians. And that is how we have to break the back of the opposing side because they have stuck with, they are stuck with a model which says that the home has to be some place from where there is a mass migration. And I refute that concept, I refute that assumption to begin with because it doesn't have to be from one place a mass migration. And it could be more complex network of travel of ideas in many different ways. So, thank you very much General Bakshi and Shri Mani Ji for all your great work and to Garuda for publishing an amazing book. I recommend all of you should get a copy, buy a copy. I was given my copy last night. And believe me, I spent many hours overnight, went through the whole thing, 200 some pages, I read the whole thing. I mean, I didn't read as slowly and carefully as I want to now read. But I went through the whole thing. And what an amazing collection of information and facts in many domains, many domains of knowledge, many disciplines, all put together into a story. I really wish somebody would make a movie on this. Thank you very much."}, "podcast_summary": "In this episode, Rajiv Malhotra discusses the movement of knowledge and culture, highlighting that the migration of people does not necessarily coincide with the spread of ideas. He provides examples such as the spread of Sanskrit education in Europe and the transfer of Indian culture to South America. He emphasizes the importance of understanding the history of ideas and how they shape civilizations. Rajiv also discusses the concepts of continuity in civilization and the difference between nation and rashtra.", "podcast_recommended_for": "This episode is recommended for history enthusiasts, those interested in the spread of ideas, and individuals seeking a deeper understanding of the origins of civilizations and the factors influencing their development.", "podcast_guest": {"name": "Hamilton", "organization": "", "title": "", "summary": ""}, "podcast_highlights": "Key highlights from the podcast episode transcript:\n\n1. The impact of misinformation: The guest highlights the importance of correcting history and the false narratives that have been perpetuated, emphasizing that what one person writes or says can have a lasting effect on society.\n\n2. Aryan theory's motives: The guest explains that the Aryan theory did not start as an Aryan theory but as part of the European discovery of Sanskrit. The desire to claim ownership of the language and reconcile it with Christianity led to the development of different theories regarding the history of Europe in relation to Sanskrit.\n\n3. Influence of Aryan theory: The guest discusses how the Aryan theory gave rise to the Dravidian movement, which later became politically significant even though it was initially rejected by many. The Dravidian movement still poses obstacles to countering the Aryan theory in India.\n\n4. Motives behind supporting the Aryan invasion theory: The guest points out that the left-wing supports the Aryan invasion theory to counter arguments that Muslims are foreigners in India. By claiming that the Vedas are also foreign, they attempt to delegitimize claims about the foreign origins of Islam.\n\n5. Movement of ideas: The guest explores the movement of knowledge and culture, stressing that knowledge can be transferred independently from the movement of people. Examples such as the spread of Sanskrit education in Europe and the influence of Indian culture on Brazilian dance demonstrate that knowledge transfer is not solely dependent on migration or invasion.\n\n6. Continuity and evolution of civilization: The guest clarifies that continuity of civilization does not mean a fixed or frozen state. He argues that India's ability to assimilate new ideas and adopt change is a sign of a healthy civilization, emphasizing the importance of allowing for evolution while being grounded in a strong foundational framework.\n\n7. Rashtra vs. nation: The guest highlights the difference between Rashtra and nation, stating that a Rashtra does not require one race, language, or religion. He examines the Vedas and seeks to articulate the concept of Rashtra, aiming to differentiate it from the European notion of nationhood.\n\n8. The ongoing battle: The guest asserts that the battle to correct historical distortions is a long-term one, requiring continuous research and the involvement of multidisciplinary experts. He emphasizes the importance of training young people and encouraging further research to counter opposing arguments.\n\nOverall, the guest provides insights into the impact of historical narratives, counters the motives behind the Aryan theory, discusses the movement of ideas, and highlights the need for a nuanced understanding of civilization and Rashtra."}